In [1]:
import pandas as pd
import numpy as np

In [4]:
#Creating a series with custom index
Series1= pd.Series([90,90,87,100,90], index=['Marks1', 'Marks2', 'Marks3', 'Marks4', 'Marks5'])

In [5]:
Series1

Marks1     90
Marks2     90
Marks3     87
Marks4    100
Marks5     90
dtype: int64

In [6]:
#Creating series with range()
Series2= pd.Series(range(1,21,2))
Series2

0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
8    17
9    19
dtype: int64

In [7]:
#Creating series with randint()
Series3=pd.Series(np.random.randint(1,100,20))
Series3

0      5
1     50
2     69
3     15
4     64
5     95
6     63
7      3
8     33
9     51
10     5
11    83
12     3
13    42
14    87
15    36
16    74
17    40
18    11
19    32
dtype: int64

In [8]:
#Findind mean, std, min, max, head, tail
Series3.mean()

43.05

In [9]:
Series3.median()

41.0

In [10]:
Series3.std()

29.918265851799422

In [11]:
Series3.min()

3

In [12]:
Series3.max()

95

In [13]:
Series3.head(6)

0     5
1    50
2    69
3    15
4    64
5    95
dtype: int64

In [14]:
Series3.tail()

15    36
16    74
17    40
18    11
19    32
dtype: int64

In [15]:
Series3.describe()

count    20.000000
mean     43.050000
std      29.918266
min       3.000000
25%      14.000000
50%      41.000000
75%      65.250000
max      95.000000
dtype: float64

In [16]:
#Creating series with arange()
Series4=pd.Series(np.arange(5,45,5))
Series4

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
dtype: int64

In [17]:
#Creating series with full()
Series5=pd.Series(np.full(4,15))
Series5

0    15
1    15
2    15
3    15
dtype: int64

In [18]:
Series6=pd.Series(['C','C++','Java','Python'], index=['Vijay','Nathan','Shakthi','Aditi'])
Series6

Vijay           C
Nathan        C++
Shakthi      Java
Aditi      Python
dtype: object

In [19]:
#Accessing the value through custom index
Series6['Aditi']

'Python'

In [20]:
#Accessing value by calling the attribute
Series6.Shakthi

'Java'

In [21]:
#Creating Series with a dictionary
Series7=pd.Series({'Shakthi': 6027, 'Rebecca': 6025, 'Prashita': 6029})
Series7

Shakthi     6027
Rebecca     6025
Prashita    6029
dtype: int64

In [22]:
S1=Series7['Rebecca']
S2=Series7.Shakthi
print(S1)
print(S2)

6025
6027

In [23]:
#String functions on Series
Series8=pd.Series(['Ana','Griffin','Mathew','Jerome', 'Kim'])
Series8.str.contains('e')

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [24]:
Series8.str.upper()

0        ANA
1    GRIFFIN
2     MATHEW
3     JEROME
4        KIM
dtype: object

In [25]:
#Creating two lists and passing them as values and indexes to create series
List1=['Shakthi', 'Vijay','Aditi', 'Nathan']
List2=['Burrito', 'Chimichanga', 'Enchilada', 'Taco']
Series9= pd.Series(data=List2, index=List1)
Series9

Shakthi        Burrito
Vijay      Chimichanga
Aditi        Enchilada
Nathan            Taco
dtype: object

In [26]:
#Adding two series
Series1=pd.Series([10,20,30,40],index=['Class1','Class2','Class3','Class4'])
Series2=pd.Series([40,30,90,80],index=['Class1','Class2','Class3','Class4'])
Series1+Series2

Class1     50
Class2     50
Class3    120
Class4    120
dtype: int64

In [2]:
#Creating Data Frames- custom 2 d arrays
Diction_Sales={'Apparel':[400,350,375,670], 'Home_Electronics': [1000,1500,950,2000], 
               'Toys':[120,130,120,150], 'HomeGoods':[200,240,190,300]}
DataFrame_Sales=pd.DataFrame(Diction_Sales, index=['Sep','Oct','Nov','Dec'])
DataFrame_Sales

     Apparel  Home_Electronics  Toys  HomeGoods
Sep      400              1000   120        200
Oct      350              1500   130        240
Nov      375               950   120        190
Dec      670              2000   150        300

In [16]:
#Accesing elements through column index
type(DataFrame_Sales['Toys'])

pandas.core.series.Series

In [13]:
DataFrame_Sales>150

     Apparel  Home_Electronics   Toys  HomeGoods
Sep     True              True  False       True
Oct     True              True  False       True
Nov     True              True  False       True
Dec     True              True  False       True

In [14]:
DataFrame_Sales[DataFrame_Sales>150]

     Apparel  Home_Electronics  Toys  HomeGoods
Sep      400              1000   NaN        200
Oct      350              1500   NaN        240
Nov      375               950   NaN        190
Dec      670              2000   NaN        300

In [29]:
DataFrame_Sales.Toys

Sep    120
Oct    130
Nov    120
Dec    150
Name: Toys, dtype: int64

In [30]:
#Locating elements using loc[] and iloc[]- for row/column index
DataFrame_Sales.loc['Sep']

Apparel              400
Home_Electronics    1000
Toys                 120
HomeGoods            200
Name: Sep, dtype: int64

In [31]:
DataFrame_Sales.loc['Sep':'Dec', ['Apparel','Toys']]

     Apparel  Toys
Sep      400   120
Oct      350   130
Nov      375   120
Dec      670   150

In [32]:
DataFrame_Sales.iloc[3]

Apparel              670
Home_Electronics    2000
Toys                 150
HomeGoods            300
Name: Dec, dtype: int64

In [33]:
DataFrame_Sales[DataFrame_Sales > 150]

     Apparel  Home_Electronics  Toys  HomeGoods
Sep      400              1000   NaN        200
Oct      350              1500   NaN        240
Nov      375               950   NaN        190
Dec      670              2000   NaN        300

In [34]:
DataFrame_Sales[(DataFrame_Sales>120) & (DataFrame_Sales< 300)]

     Apparel  Home_Electronics   Toys  HomeGoods
Sep      NaN               NaN    NaN      200.0
Oct      NaN               NaN  130.0      240.0
Nov      NaN               NaN    NaN      190.0
Dec      NaN               NaN  150.0        NaN

In [35]:
DataFrame_Sales[(DataFrame_Sales>120) | (DataFrame_Sales< 300)]

     Apparel  Home_Electronics  Toys  HomeGoods
Sep      400              1000   120        200
Oct      350              1500   130        240
Nov      375               950   120        190
Dec      670              2000   150        300

In [36]:
# Accessing elements using at[] and iat[]
DataFrame_Sales.at['Oct', 'Apparel']

350

In [37]:
DataFrame_Sales.iat[0,1]

1000

In [38]:
DataFrame_Sales.iat[0,1]=999
DataFrame_Sales

     Apparel  Home_Electronics  Toys  HomeGoods
Sep      400               999   120        200
Oct      350              1500   130        240
Nov      375               950   120        190
Dec      670              2000   150        300

In [39]:
#Calculating mean- always calculates by column
DataFrame_Sales.mean()

Apparel              448.75
Home_Electronics    1362.25
Toys                 130.00
HomeGoods            232.50
dtype: float64

In [40]:
#Transpose and functions
DataFrame_Sales.T

                  Sep   Oct  Nov   Dec
Apparel           400   350  375   670
Home_Electronics  999  1500  950  2000
Toys              120   130  120   150
HomeGoods         200   240  190   300

In [41]:
DataFrame_Sales.T.mean()

Sep    429.75
Oct    555.00
Nov    408.75
Dec    780.00
dtype: float64

In [42]:
DataFrame_Sales.T.describe()

              Sep          Oct         Nov          Dec
count    4.000000     4.000000    4.000000     4.000000
mean   429.750000   555.000000  408.750000   780.000000
std    397.349867   636.369913  376.527445   842.179712
min    120.000000   130.000000  120.000000   150.000000
25%    180.000000   212.500000  172.500000   262.500000
50%    300.000000   295.000000  282.500000   485.000000
75%    549.750000   637.500000  518.750000  1002.500000
max    999.000000  1500.000000  950.000000  2000.000000

In [43]:
#Sorting based on data frame index
DataFrame_Sales.sort_index(ascending=True)

     Apparel  Home_Electronics  Toys  HomeGoods
Dec      670              2000   150        300
Nov      375               950   120        190
Oct      350              1500   130        240
Sep      400               999   120        200

In [44]:
DataFrame_Sales.sort_index(ascending=False)

     Apparel  Home_Electronics  Toys  HomeGoods
Sep      400               999   120        200
Oct      350              1500   130        240
Nov      375               950   120        190
Dec      670              2000   150        300

In [45]:
#Sorting based on column by switching teh axis to axis=1
DataFrame_Sales.sort_index(ascending=True, axis=1)

     Apparel  HomeGoods  Home_Electronics  Toys
Sep      400        200               999   120
Oct      350        240              1500   130
Nov      375        190               950   120
Dec      670        300              2000   150

In [46]:
#Adding a new column
DataFrame_Sales['KitchenEssentials']=[500, 540, 490, 670]

In [47]:
DataFrame_Sales

     Apparel  Home_Electronics  Toys  HomeGoods  KitchenEssentials
Sep      400               999   120        200                500
Oct      350              1500   130        240                540
Nov      375               950   120        190                490
Dec      670              2000   150        300                670

In [48]:
#Adding a new row using append()- with and without label
#without label
Dict_new={'Apparel': 400, 'Home_Electronics': 900, 'Toys': 100, 'HomeGoods': 200, 'KitchenEssentials': 450}
#Series_newrow=pd.Series(data=Dict_new, name='Jan')
DataFrame_Sales.append(Dict_new, ignore_index= True)

   Apparel  Home_Electronics  Toys  HomeGoods  KitchenEssentials
0      400               999   120        200                500
1      350              1500   130        240                540
2      375               950   120        190                490
3      670              2000   150        300                670
4      400               900   100        200                450

In [49]:
#with label
Dict_newrow2={'Apparel': 390, 'Home_Electronics': 1000, 'Toys': 120, 'HomeGoods': 230, 'KitchenEssentials':460 }
Series1_newrow=pd.Series(data=Dict_newrow2, name='Feb')
DataFrame_Sales.append(Series1_newrow, ignore_index= False)

     Apparel  Home_Electronics  Toys  HomeGoods  KitchenEssentials
Sep      400               999   120        200                500
Oct      350              1500   130        240                540
Nov      375               950   120        190                490
Dec      670              2000   150        300                670
Feb      390              1000   120        230                460

In [50]:
#Deleting items- pop(), del or drop()
#pop and del
del DataFrame_Sales['Home_Electronics']

In [51]:
DataFrame_Sales

     Apparel  Toys  HomeGoods  KitchenEssentials
Sep      400   120        200                500
Oct      350   130        240                540
Nov      375   120        190                490
Dec      670   150        300                670

In [52]:
DataFrame_Sales.pop('Toys')

Sep    120
Oct    130
Nov    120
Dec    150
Name: Toys, dtype: int64

In [53]:
DataFrame_Sales

     Apparel  HomeGoods  KitchenEssentials
Sep      400        200                500
Oct      350        240                540
Nov      375        190                490
Dec      670        300                670

In [54]:
#deleting rows-- using drop()- multiple items can be dropped
DataFrame_Sales.drop(['Jan'])

KeyError: "['Jan'] not found in axis"

In [ ]:
DataFrame_Sales.drop(['KitchenEssentials'], axis=1)

In [ ]:
#Head() and tail()
DataFrame_Sales.head()

In [ ]:
DataFrame_Sales.tail()

In [ ]:
#inserting columns
DataFrame_Sales.insert(2, 'Toys',[120,130,140,110,130,120])

In [ ]:
DataFrame_Sales

In [ ]:
DataFrame_Sales['HomeGoods']+=100

In [ ]:
DataFrame_Sales

In [ ]:
#Counting values for a column
DataFrame_Sales['Toys'].value_counts()

In [55]:
#Multi-level index
Level1=['Group1', 'Group1', 'Group1', 'Group2', 'Group2', 'Group2', 'Group3', 'Group3', 'Group3']
Level2=['Index1', 'Index2', 'Index3', 'Index1', 'Index2', 'Index3', 'Index1', 'Index2', 'Index3']
Hierarchy=list(zip(Level1,Level2))
Hierarchy

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [ ]:
Hierarchy= pd.MultiIndex.from_tuples(Hierarchy)
Hierarchy

In [ ]:
Hierarchy.levels

In [ ]:
Hierarchy.codes

In [ ]:
#Creating a dataframe with multi-level index
Frame_Data= np.random.randint(1,100, 45)
Array2d=Frame_Data.reshape(9,5)
Hier_DataFrame= pd.DataFrame(Array2d, Hierarchy,
                             columns=['Column1','Column2','Column3','Column4','Column5'])
Hier_DataFrame

In [ ]:
#Accessing elements through multilevel index
Hier_DataFrame['Column1']

In [ ]:
Hier_DataFrame.loc['Group3']

In [ ]:
Hier_DataFrame.loc['Group1'].loc['Index2']

In [ ]:
#Giving label for Index
Hier_DataFrame.index.names=['Groups','Indexes']
Hier_DataFrame

In [ ]:
Hier_DataFrame.xs('Index1', level='Indexes')

In [56]:
COVIDData={'Country':['Japan','Malaysia','Spain','Singapore','Italy','Morocco','Germany','Egypt','USA','Canada','Brazil'],
          'Continent':['Asia','Asia','Europe','Asia','Europe','Africa','Europe','Africa','America','America','America'],
          'Case':[455,90,430,138,5883,2,795,48,213,57,19],
           'Death':['Yes','No','Yes','No','Yes','No','No','No','Yes','No','No']
          }
Covid_DataFrame=pd.DataFrame(COVIDData, index=[1,2,3,4,5,6,7,8,9,10,11])
Covid_DataFrame

      Country Continent  Case Death
1       Japan      Asia   455   Yes
2    Malaysia      Asia    90    No
3       Spain    Europe   430   Yes
4   Singapore      Asia   138    No
5       Italy    Europe  5883   Yes
6     Morocco    Africa     2    No
7     Germany    Europe   795    No
8       Egypt    Africa    48    No
9         USA   America   213   Yes
10     Canada   America    57    No
11     Brazil   America    19    No

In [ ]:
#Groupby function
Covid_DF_Group=Covid_DataFrame.groupby('Continent')
Covid_DF_Group

In [ ]:
Covid_DF_Group.groups

In [ ]:
for i, j in Covid_DF_Group:
    print(i)
    print(j)

In [ ]:
#Different functions for groupby
#Size of each group- no. of rows
Covid_DF_Group.size()

In [ ]:
NewGroup=Covid_DataFrame.groupby(['Continent', 'Death'])
NewGroup.size()

In [ ]:
#Aggregate functions
Covid_DF_Group.agg(np.mean)

In [ ]:
Covid_DF_Group['Case'].agg([np.sum, np.mean, np.std, np.max])

In [ ]:
#String method for Series
Cars=pd.Series({'Car1':'Mercedes', 'Car2':'Lamborgini', 'Car3':'Tesla', 'Car4':'Jaguar'})
Cars

In [ ]:
Cars.str.match(r'\w{5}')

In [ ]:
Cars.str.contains('[A-Z][a-z]{5}')

In [57]:
#NaN functions
Array1=np.array([[1,2,3,np.nan,np.nan],[4,5,np.nan,7,np.nan],[8,9,np.nan,np.nan,10],[14,np.nan,3,4,6]])
DataFrame1=pd.DataFrame(Array1, index=['Index1','Index2','Index3','Index4'],
                        columns=['Col1','Col2','Col3','Col4','Col5'])
DataFrame1

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   NaN   NaN
Index2   4.0   5.0   NaN   7.0   NaN
Index3   8.0   9.0   NaN   NaN  10.0
Index4  14.0   NaN   3.0   4.0   6.0

In [58]:
DataFrame1.isna()

         Col1   Col2   Col3   Col4   Col5
Index1  False  False  False   True   True
Index2  False  False   True  False   True
Index3  False  False   True   True  False
Index4  False   True  False  False  False

In [59]:
DataFrame1['Col3'].isna()

Index1    False
Index2     True
Index3     True
Index4    False
Name: Col3, dtype: bool

In [60]:
DataFrame1.dropna(axis=1)

        Col1
Index1   1.0
Index2   4.0
Index3   8.0
Index4  14.0

In [61]:
#Thresh arguments tells you how many not Nan values should be present
DataFrame1.dropna(thresh=4)

        Col1  Col2  Col3  Col4  Col5
Index4  14.0   NaN   3.0   4.0   6.0

In [62]:
DataFrame1['Col1'].sum()

27.0

In [63]:
#Handling missing data- fillna(), replace(), interpolate()
#Fillna fills by columns
DataFrame1

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   NaN   NaN
Index2   4.0   5.0   NaN   7.0   NaN
Index3   8.0   9.0   NaN   NaN  10.0
Index4  14.0   NaN   3.0   4.0   6.0

In [64]:
DataFrame1.fillna(method='bfill')

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   7.0  10.0
Index2   4.0   5.0   3.0   7.0  10.0
Index3   8.0   9.0   3.0   4.0  10.0
Index4  14.0   NaN   3.0   4.0   6.0

In [65]:
DataFrame1.fillna(method='ffill')

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   NaN   NaN
Index2   4.0   5.0   3.0   7.0   NaN
Index3   8.0   9.0   3.0   7.0  10.0
Index4  14.0   9.0   3.0   4.0   6.0

In [66]:
Values={'Col1':2, 'Col2':4,'Col3':6,'Col4':5,'Col5':6}
DataFrame1.fillna(value= Values)

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   5.0   6.0
Index2   4.0   5.0   6.0   7.0   6.0
Index3   8.0   9.0   6.0   5.0  10.0
Index4  14.0   4.0   3.0   4.0   6.0

In [67]:
#limit argument indicates how many Nan values are allowed/permitted
DataFrame1.fillna(5,limit =1)

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   5.0   5.0
Index2   4.0   5.0   5.0   7.0   NaN
Index3   8.0   9.0   NaN   NaN  10.0
Index4  14.0   5.0   3.0   4.0   6.0

In [68]:
DataFrame1.replace(to_replace=3.0, value=9.0)

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   9.0   NaN   NaN
Index2   4.0   5.0   NaN   7.0   NaN
Index3   8.0   9.0   NaN   NaN  10.0
Index4  14.0   NaN   9.0   4.0   6.0

In [69]:
Covid_DataFrame

      Country Continent  Case Death
1       Japan      Asia   455   Yes
2    Malaysia      Asia    90    No
3       Spain    Europe   430   Yes
4   Singapore      Asia   138    No
5       Italy    Europe  5883   Yes
6     Morocco    Africa     2    No
7     Germany    Europe   795    No
8       Egypt    Africa    48    No
9         USA   America   213   Yes
10     Canada   America    57    No
11     Brazil   America    19    No

In [70]:
Covid_DataFrame.replace(to_replace=r'S.*', value='S4', regex= True)

     Country Continent  Case Death
1      Japan      Asia   455   Yes
2   Malaysia      Asia    90    No
3         S4    Europe   430   Yes
4         S4      Asia   138    No
5      Italy    Europe  5883   Yes
6    Morocco    Africa     2    No
7    Germany    Europe   795    No
8      Egypt    Africa    48    No
9        US4   America   213   Yes
10    Canada   America    57    No
11    Brazil   America    19    No

In [71]:
DataFrame1

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   NaN   NaN
Index2   4.0   5.0   NaN   7.0   NaN
Index3   8.0   9.0   NaN   NaN  10.0
Index4  14.0   NaN   3.0   4.0   6.0

In [72]:
DataFrame1.interpolate(method='linear', limit_direction='forward')

        Col1  Col2  Col3  Col4  Col5
Index1   1.0   2.0   3.0   NaN   NaN
Index2   4.0   5.0   3.0   7.0   NaN
Index3   8.0   9.0   3.0   5.5  10.0
Index4  14.0   9.0   3.0   4.0   6.0

In [73]:
#Combining dataframes- using concat()
SalesData1={'Chocolate':[50,20,40,60],'Biscuit':[100,90,120,110],'Pretzel':[90,85,70,75], 'Cookies':[120,115,140,130]}
SalesFrame1=pd.DataFrame(SalesData1,index=['Week1','Week2','Week3','Week4'])
SalesFrame1

       Chocolate  Biscuit  Pretzel  Cookies
Week1         50      100       90      120
Week2         20       90       85      115
Week3         40      120       70      140
Week4         60      110       75      130

In [74]:
SalesData2={'Chocolate':[40,50,60,30],'Biscuit':[110,80,105,120],'Pretzel':[80,90,85,95], 'Cookies':[130,125,120,110]}
SalesFrame2=pd.DataFrame(SalesData2,index=['Week1','Week2','Week3','Week4'])

In [75]:
SalesData3={'Chocolate':[20,60,65,45],'Biscuit':[100,90,115,110],'Pretzel':[90,95,75,65], 'Cookies':[140,135,140,130]}
SalesFrame3=pd.DataFrame(SalesData3,index=['Week1','Week2','Week3','Week4'])

In [76]:
SalesDataFrame=pd.concat([SalesFrame1,SalesFrame2,SalesFrame3])
SalesDataFrame

       Chocolate  Biscuit  Pretzel  Cookies
Week1         50      100       90      120
Week2         20       90       85      115
Week3         40      120       70      140
Week4         60      110       75      130
Week1         40      110       80      130
Week2         50       80       90      125
Week3         60      105       85      120
Week4         30      120       95      110
Week1         20      100       90      140
Week2         60       90       95      135
Week3         65      115       75      140
Week4         45      110       65      130

In [77]:
SalesDataFrameWithKey=pd.concat([SalesFrame1,SalesFrame2,SalesFrame3],keys=['Month1','Month2','Month3'])

In [78]:
SalesDataFrameWithKey

              Chocolate  Biscuit  Pretzel  Cookies
Month1 Week1         50      100       90      120
       Week2         20       90       85      115
       Week3         40      120       70      140
       Week4         60      110       75      130
Month2 Week1         40      110       80      130
       Week2         50       80       90      125
       Week3         60      105       85      120
       Week4         30      120       95      110
Month3 Week1         20      100       90      140
       Week2         60       90       95      135
       Week3         65      115       75      140
       Week4         45      110       65      130

In [79]:
#CombiningDataFrame using append()
CombinedDF=SalesFrame1.append([SalesFrame2,SalesFrame3])
CombinedDF

       Chocolate  Biscuit  Pretzel  Cookies
Week1         50      100       90      120
Week2         20       90       85      115
Week3         40      120       70      140
Week4         60      110       75      130
Week1         40      110       80      130
Week2         50       80       90      125
Week3         60      105       85      120
Week4         30      120       95      110
Week1         20      100       90      140
Week2         60       90       95      135
Week3         65      115       75      140
Week4         45      110       65      130

In [80]:
#Combining data frames- merge() and join()
#merge()
SalesFrame1

       Chocolate  Biscuit  Pretzel  Cookies
Week1         50      100       90      120
Week2         20       90       85      115
Week3         40      120       70      140
Week4         60      110       75      130

In [81]:
SalesFrame2

       Chocolate  Biscuit  Pretzel  Cookies
Week1         40      110       80      130
Week2         50       80       90      125
Week3         60      105       85      120
Week4         30      120       95      110

In [82]:
#merge()
MergedData=pd.merge(SalesFrame1,SalesFrame2, on= 'Chocolate', how='outer')

In [83]:
MergedData

   Chocolate  Biscuit_x  Pretzel_x  Cookies_x  Biscuit_y  Pretzel_y  Cookies_y
0         50      100.0       90.0      120.0       80.0       90.0      125.0
1         20       90.0       85.0      115.0        NaN        NaN        NaN
2         40      120.0       70.0      140.0      110.0       80.0      130.0
3         60      110.0       75.0      130.0      105.0       85.0      120.0
4         30        NaN        NaN        NaN      120.0       95.0      110.0

In [88]:
Person= {'ID': [1,2,3,4,5], 'Name': ['John', 'Mary','Ed','Matt','Joe'], 'Age': [40,30,34,45,34]}
Person1= pd.DataFrame(Person)
Person1

   ID  Name  Age
0   1  John   40
1   2  Mary   30
2   3    Ed   34
3   4  Matt   45
4   5   Joe   34

In [89]:
Profession= {'ID': [1,2,3,4,6], 'Profession':['Engineer', 'Teacher', 'Astronaut', 'Salesman','Lawyer']}
Profession1=pd.DataFrame(Profession)
Profession1

   ID Profession
0   1   Engineer
1   2    Teacher
2   3  Astronaut
3   4   Salesman
4   6     Lawyer

In [94]:
#Join()- here original index stays the same.
JoinedSet=Person1.join(Profession1.set_index('ID'), on= 'ID', how='outer')
JoinedSet

     ID  Name   Age Profession
0.0   1  John  40.0   Engineer
1.0   2  Mary  30.0    Teacher
2.0   3    Ed  34.0  Astronaut
3.0   4  Matt  45.0   Salesman
4.0   5   Joe  34.0        NaN
NaN   6   NaN   NaN     Lawyer

In [97]:
#Join()- to set index as the primary key.. do this
JoinedSet=Person1.set_index('ID').join(Profession1.set_index('ID'))
JoinedSet

    Name  Age Profession
ID
1   John   40   Engineer
2   Mary   30    Teacher
3     Ed   34  Astronaut
4   Matt   45   Salesman
5    Joe   34        NaN

In [98]:
#Dropping coluns, sorting columns
MergedData

   Chocolate  Biscuit_x  Pretzel_x  Cookies_x  Biscuit_y  Pretzel_y  Cookies_y
0         50      100.0       90.0      120.0       80.0       90.0      125.0
1         20       90.0       85.0      115.0        NaN        NaN        NaN
2         40      120.0       70.0      140.0      110.0       80.0      130.0
3         60      110.0       75.0      130.0      105.0       85.0      120.0
4         30        NaN        NaN        NaN      120.0       95.0      110.0

In [103]:
MergedData.drop(['Biscuit_y'], axis=1)

   Chocolate  Biscuit_x  Pretzel_x  Cookies_x  Pretzel_y  Cookies_y
0         50      100.0       90.0      120.0       90.0      125.0
1         20       90.0       85.0      115.0        NaN        NaN
2         40      120.0       70.0      140.0       80.0      130.0
3         60      110.0       75.0      130.0       85.0      120.0
4         30        NaN        NaN        NaN       95.0      110.0

In [104]:
MergedData.sort_values('Chocolate')

   Chocolate  Biscuit_x  Pretzel_x  Cookies_x  Biscuit_y  Pretzel_y  Cookies_y
1         20       90.0       85.0      115.0        NaN        NaN        NaN
4         30        NaN        NaN        NaN      120.0       95.0      110.0
2         40      120.0       70.0      140.0      110.0       80.0      130.0
0         50      100.0       90.0      120.0       80.0       90.0      125.0
3         60      110.0       75.0      130.0      105.0       85.0      120.0

In [111]:
MergedData[(0,'Pretzel_y')]=90

In [120]:
MergedData.drop(['(0,Pretzel)','(4,Pretzel)','(3,Pretzel)'], axis=1)

KeyError: "['(0,Pretzel)' '(4,Pretzel)' '(3,Pretzel)'] not found in axis"

In [116]:
MergedData

,Chocolate,Biscuit_x,Pretzel_x,Cookies_x,Biscuit_y,Pretzel_y,Cookies_y,"(4, Pretzel_y)","(3, Pretzel_y)","(0, Pretzel_y)"
0,50,100.0,90.0,120.0,80.0,90.0,125.0,90,90,90
1,20,90.0,85.0,115.0,NaN,NaN,NaN,90,90,90
2,40,120.0,70.0,140.0,110.0,80.0,130.0,90,90,90
3,60,110.0,75.0,130.0,105.0,85.0,120.0,90,90,90
4,30,NaN,NaN,NaN,120.0,95.0,110.0,90,90,90